# Middleware
antiflood = 'Не нажимайте слишком часто!'

# Main
menu = 'Выберите действие:'

# Wallet
wallet = 'Выберите способ подключения кошелька:'

wallet_conn_expired = 'Время ожидания подключения истекло'

wallet_conn_succeed = 'Вы успешно подключили кошелек!'

wallet_connected = 'Ваш кошелек уже подключен!'

wallet_transfer_address = 'Введите адрес кошелька'

wallet_transfer_toncoin_amount = 'Введите количество TON'

wallet_address_error = 'Вы ввели неправильный адрес кошелька'

wallet_toncoin_amount_error = 'Количество TON должно быть числом'

wallet_disconnect = 'Вы успешно отключили кошелек!'

# Wallet Dialog
wallet_dialog_address = 'Адрес: <b>{address}</b>'

wallet_dialog_toncoin_amount = 'Количество TON: 💎<b>{toncoin_amount}</b>'

wallet_dialog_cancel_transfer = '❌ Отменить транзакцию'

wallet_dialog_confirm_transfer = '✅ Подтвердить транзакцию'

# Jetton
jetton = 'Получить информацию о жеттоне можно следующими способами:'

jetton_contract = 'Введите адрес жеттона'

jetton_name = 'Выберите тикер жеттона:'

jetton_contract_error = 'Вы ввели неправильный адрес жеттона'

jetton_dexes = 'Выберите DEX:'

# NFT
nft = 'Получить информацию об NFT можно следующими способами:'

nft_search = 'Что хотите найти?'

nft_search_collection = 'Введите адрес коллекции'

nft_search_nft = 'Введите адрес NFT'

nft_collection_history = 'Выберите период истории продаж:'

nft_name = 'Выберите коллекцию NFT:'

nft_contract_error = 'Вы ввели неправильный адрес NFT'

# App
app = 'Выберите категорию приложения:'
